#+TITLE: Plan for Vlabs Automated Testing
#+AUTHOR: VLEAD
#+DATE: [2018-02-15 Thu]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate

* Introduction
  - This document contains the realization plan for
    implementing the Vlabs Automated Testing.

* Detailed Plan 
** Implementation of Automated Export and Import of an OpenedX lab.
#+caption:  realization-plan-milestone-8
#+name: tbl-rlz-pln-ml-8

|---+-------+------------------------------------------------------+--------+----------+--------+-----------+--------+--------+----------|
|   | S.    | Tasks                                                | Github | Expected | Actual | Estimated | Actual | Status | Assignee |
|   | NO    |                                                      | Issues | Effort   | Effort | Start,    | Start/ |        |          |
|   |       |                                                      |        | (in      | (in    | End       | End    |        |          |
|   |       |                                                      |        | person   | person | Dates     | Dates  |        |          |
|   |       |                                                      |        | hours)   | hours) |           |        |        |          |
|---+-------+------------------------------------------------------+--------+----------+--------+-----------+--------+--------+----------|
|   | 1.    | Implementation of Automated Export of an OpenedX lab | [[https://github.com/vlead/vlabs-automated-testing/issues/1][#1]]     | 24       | 12     |           |        |        | Madhavi  |
|   |       |                                                      |        |          |        |           |        |        |          |
|---+-------+------------------------------------------------------+--------+----------+--------+-----------+--------+--------+----------|
|   | 2.    | Implementation of Automated Import of an OpenedX lab | [[https://github.com/vlead/vlabs-automated-testing/issues/2][#2]]     | 24       |        |           |        |        | Madhavi  |
|   |       |                                                      |        |          |        |           |        |        |          |
|   |       |                                                      |        |          |        |           |        |        |          |
|---+-------+------------------------------------------------------+--------+----------+--------+-----------+--------+--------+----------|
|   | Total |                                                      |        | 129      | 81     |           |        |        |          |
| ^ |       |                                                      |        | est      | act    |           |        |        |          |
|---+-------+------------------------------------------------------+--------+----------+--------+-----------+--------+--------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)


